; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite2 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite3 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	thermograph2 - mode
	thermograph0 - mode
	image1 - mode
	thermograph3 - mode
	GroundStation5 - direction
	Star6 - direction
	Star11 - direction
	Star0 - direction
	GroundStation7 - direction
	Star1 - direction
	Star2 - direction
	GroundStation14 - direction
	Star10 - direction
	GroundStation12 - direction
	GroundStation3 - direction
	Star13 - direction
	Star9 - direction
	GroundStation8 - direction
	GroundStation4 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Planet19 - direction
	Planet20 - direction
	Star21 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star0)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 Star10)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 Star10)
	(supports instrument3 image1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation7)
	(calibration_target instrument3 Star13)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star21)
	(supports instrument4 thermograph2)
	(supports instrument4 thermograph3)
	(supports instrument4 image1)
	(calibration_target instrument4 Star13)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 GroundStation7)
	(supports instrument6 thermograph2)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation14)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 Star1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument7 thermograph0)
	(supports instrument7 image1)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 GroundStation4)
	(calibration_target instrument7 Star1)
	(calibration_target instrument7 GroundStation12)
	(calibration_target instrument7 GroundStation7)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation14)
	(calibration_target instrument8 Star2)
	(calibration_target instrument8 GroundStation12)
	(calibration_target instrument8 Star13)
	(calibration_target instrument8 GroundStation8)
	(supports instrument9 thermograph2)
	(supports instrument9 image1)
	(calibration_target instrument9 Star10)
	(calibration_target instrument9 Star9)
	(calibration_target instrument9 GroundStation8)
	(supports instrument10 thermograph2)
	(supports instrument10 image1)
	(calibration_target instrument10 GroundStation12)
	(calibration_target instrument10 GroundStation3)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(on_board instrument9 satellite2)
	(on_board instrument10 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation14)
	(supports instrument11 thermograph3)
	(calibration_target instrument11 GroundStation4)
	(calibration_target instrument11 Star13)
	(calibration_target instrument11 GroundStation3)
	(calibration_target instrument11 Star9)
	(calibration_target instrument11 GroundStation12)
	(supports instrument12 thermograph3)
	(calibration_target instrument12 GroundStation8)
	(calibration_target instrument12 Star9)
	(supports instrument13 image1)
	(supports instrument13 thermograph3)
	(calibration_target instrument13 GroundStation4)
	(on_board instrument11 satellite3)
	(on_board instrument12 satellite3)
	(on_board instrument13 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star9)
)
(:goal (and
	(have_image Phenomenon15 thermograph2)
	(have_image Phenomenon16 thermograph3)
	(have_image Phenomenon17 thermograph0)
	(have_image Planet18 thermograph0)
	(have_image Planet19 thermograph3)
	(have_image Planet20 thermograph3)
	(have_image Star21 thermograph0)
))

)

; plan
1. (switch_on instrument11 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument11)
   goals met: 0 of 7
2. (calibrate satellite3 instrument11 star9)
   added: (calibrated instrument11)
   goals met: 0 of 7
3. (turn_to satellite3 planet20 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 planet20)
   goals met: 0 of 7
4. (take_image satellite3 planet20 instrument11 thermograph3)
   added: (have_image planet20 thermograph3)
   goals met: 1 of 7
5. (turn_to satellite3 planet19 planet20)
   deleted: (pointing satellite3 planet20)
   added: (pointing satellite3 planet19)
   goals met: 1 of 7
6. (take_image satellite3 planet19 instrument11 thermograph3)
   added: (have_image planet19 thermograph3)
   goals met: 2 of 7
7. (turn_to satellite3 phenomenon16 planet19)
   deleted: (pointing satellite3 planet19)
   added: (pointing satellite3 phenomenon16)
   goals met: 2 of 7
8. (turn_to satellite0 star0 star21)
   deleted: (pointing satellite0 star21)
   added: (pointing satellite0 star0)
   goals met: 2 of 7
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 7
10. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 2 of 7
11. (take_image satellite3 phenomenon16 instrument11 thermograph3)
   added: (have_image phenomenon16 thermograph3)
   goals met: 3 of 7
12. (turn_to satellite0 phenomenon15 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon15)
   goals met: 3 of 7
13. (take_image satellite0 phenomenon15 instrument0 thermograph2)
   added: (have_image phenomenon15 thermograph2)
   goals met: 4 of 7
14. (turn_to satellite0 phenomenon17 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon17)
   goals met: 4 of 7
15. (take_image satellite0 phenomenon17 instrument0 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 5 of 7
16. (turn_to satellite0 planet18 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet18)
   goals met: 5 of 7
17. (take_image satellite0 planet18 instrument0 thermograph0)
   added: (have_image planet18 thermograph0)
   goals met: 6 of 7
18. (turn_to satellite0 star21 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 star21)
   goals met: 6 of 7
19. (take_image satellite0 star21 instrument0 thermograph0)
   added: (have_image star21 thermograph0)
   goals met: 7 of 7
